# NOTE:Pandas
main data types : Series (處理時間序列,主要為一維陣列), DataFrame（處理結構化資料,如關聯式資料庫csv等等）

In [2]:
import os
import numpy as np
import pandas as pd

### Read CSV file and HTML
```
df = pd.read_csv("filename",encoding="ISO-8859-1/utf-8")
ds = pd.read_html("http://...//")
```

In [15]:
filepath = "../data/"
filename = "application_test.csv"
f_app = os.path.join(filepath,filename)
data = pd.read_csv(f_app)
#在 jupyter notebook 中，可以使用 ? 來調查函數的定義
?pd.read_csv

### Create Series

In [16]:
#1
arr = ["A","B","C","D"]
select = pd.Series(arr)
print(select)
print("")

#2
dictionary = {
    "aaa": "111",
    "bbb": "222",
    "ccc": "333",
    "ddd": "444",
    "eee": "555"
} 
select = pd.Series(dictionary,index = dictionary.keys())
print(select[[0,2,3]])

0    A
1    B
2    C
3    D
dtype: object

aaa    111
ccc    333
ddd    444
dtype: object

### Create and Operation on DataFrame

In [20]:
#1
form = {'weekday': ['Sun', 'Sun', 'Mon', 'Mon'],
        'city': ['Austin', 'Dallas', 'Austin', 'Dallas'],
        'visitor': [139, 237, 326, 456]}
visitors_1 = pd.DataFrame(form)
print(visitors_1)
print("")

#2
cities = ['Austin', 'Dallas', 'Austin', 'Dallas']
weekdays = ['Sun', 'Sun', 'Mon', 'Mon']
visitors = [139, 237, 326, 456]

list_labels = ['city', 'weekday', 'visitor']
list_cols = [cities, weekdays, visitors]

zipped = list(zip(list_labels, list_cols))
visitors_2 = pd.DataFrame(dict(zipped))
print(visitors_2)
print("")

#3
family=[["Amy","26"],["Jimmy","25"],["Jeff","23"],["Sonia","18"]]
df = pd.DataFrame(family,columns=["name","age"])
print(df)

#4
df = pd.DataFrame(data)

  weekday    city  visitor
0     Sun  Austin      139
1     Sun  Dallas      237
2     Mon  Austin      326
3     Mon  Dallas      456

     city weekday  visitor
0  Austin     Sun      139
1  Dallas     Sun      237
2  Austin     Mon      326
3  Dallas     Mon      456

    name age
0    Amy  26
1  Jimmy  25
2   Jeff  23
3  Sonia  18

In [19]:
df.shape      # 回傳列數與欄數 
df.describe()   # 回傳描述性統計
df.head(3)     # 回傳前n筆觀測值
df.tail(3)      # 回傳後n筆觀測值 
df.index        # 回傳 index 
df.info       # 回傳資料內容 
df.columns      # 回傳欄位名稱

Index(['SK_ID_CURR', 'NAME_CONTRACT_TYPE', 'CODE_GENDER', 'FLAG_OWN_CAR',
       'FLAG_OWN_REALTY', 'CNT_CHILDREN', 'AMT_INCOME_TOTAL', 'AMT_CREDIT',
       'AMT_ANNUITY', 'AMT_GOODS_PRICE',
       ...
       'FLAG_DOCUMENT_18', 'FLAG_DOCUMENT_19', 'FLAG_DOCUMENT_20',
       'FLAG_DOCUMENT_21', 'AMT_REQ_CREDIT_BUREAU_HOUR',
       'AMT_REQ_CREDIT_BUREAU_DAY', 'AMT_REQ_CREDIT_BUREAU_WEEK',
       'AMT_REQ_CREDIT_BUREAU_MON', 'AMT_REQ_CREDIT_BUREAU_QRT',
       'AMT_REQ_CREDIT_BUREAU_YEAR'],
      dtype='object', length=121)

### 資料選擇及新增
* DataFrame.insert(3,column="sport",value="Basketball")
* DataFrame.loc(row_label,col_label) 
* DataFrame.iloc(row_index,col_index)

In [21]:
df["AMT_INCOME_TOTAL"]
df["AMT_INCOME_TOTAL"][0:4]
df[["SK_ID_CURR","AMT_INCOME_TOTAL"]]
df.loc[0:3,"SK_ID_CURR":"AMT_INCOME_TOTAL"]
df.iloc[0:2,10:13] #take 0~2 rows 10~13 cols

  NAME_TYPE_SUITE NAME_INCOME_TYPE            NAME_EDUCATION_TYPE
0   Unaccompanied          Working               Higher education
1   Unaccompanied          Working  Secondary / secondary special

### 資料排序

In [23]:
sorteddf = df.sort_index(axis = 0, ascending = True)
sorteddf = df.sort_values(by = "AMT_INCOME_TOTAL")
sorteddf.head(5)

,SK_ID_CURR,NAME_CONTRACT_TYPE,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,AMT_CREDIT,AMT_ANNUITY,AMT_GOODS_PRICE,...,FLAG_DOCUMENT_18,FLAG_DOCUMENT_19,FLAG_DOCUMENT_20,FLAG_DOCUMENT_21,AMT_REQ_CREDIT_BUREAU_HOUR,AMT_REQ_CREDIT_BUREAU_DAY,AMT_REQ_CREDIT_BUREAU_WEEK,AMT_REQ_CREDIT_BUREAU_MON,AMT_REQ_CREDIT_BUREAU_QRT,AMT_REQ_CREDIT_BUREAU_YEAR
19883,244403,Cash loans,F,N,Y,0,26941.5,229500.0,11848.5,229500.0,...,0,0,0,0,0.0,0.0,0.0,0.0,1.0,3.0
4027,128720,Cash loans,F,N,Y,0,27000.0,450000.0,25128.0,450000.0,...,0,0,0,0,0.0,0.0,0.0,0.0,1.0,0.0
8593,162802,Cash loans,F,N,Y,0,27000.0,148140.0,7690.5,112500.0,...,0,0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
47425,446665,Cash loans,F,N,Y,0,27000.0,601470.0,30838.5,450000.0,...,0,0,0,0,0.0,0.0,0.0,0.0,0.0,0.0
7375,153924,Cash loans,F,Y,N,1,27000.0,450000.0,19048.5,450000.0,...,0,0,0,0,0.0,0.0,0.0,0.0,1.0,1.0

### 判斷是否為空值

In [ ]:
df.isnull()
df.notnull()
df.dropna()   # 有遺失值的觀測值都刪除  
df.fillna(0)  # 有遺失值的觀測值填補0

### DataFrame運算

In [24]:
visitors_1.groupby(by="weekday")['visitor'].mean()

weekday
Mon    391
Sun    188
Name: visitor, dtype: int64

# Reference
* [Pandas dtypes 数据类型](https://blog.csdn.net/claroja/article/details/72622375)